## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
redis.tf
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.superset-redis.aws_elasticache_cluster.default will be created
  + resource "aws_elasticache_cluster" "default" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "cds-redis"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.1"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = (known after apply)
      + network_type               = (known after apply)
      + node_type                  = "cache.t2.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "default.redis7"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "cds-redis-subnet-grp"
      + tags                       = {
          + "CostCentre" = "cds-superset-prod"
          + "Name"       = "cds-cluster"
          + "Terraform"  = "true"
          + "module"     = "elastic-cache"
        }
      + tags_all                   = {
          + "CostCentre" = "cds-superset-prod"
          + "Name"       = "cds-cluster"
          + "Terraform"  = "true"
          + "module"     = "elastic-cache"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # module.superset-redis.aws_elasticache_subnet_group.default will be created
  + resource "aws_elasticache_subnet_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "cds-redis-subnet-grp"
      + subnet_ids  = [
          + "subnet-09fbcf711c8abc44c",
          + "subnet-0b910474dd8b7ce8f",
        ]
      + tags_all    = (known after apply)
    }

  # module.superset-redis.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Default redis security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cds-redis-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "cds-superset-prod"
          + "Name"       = "cds-sg"
          + "Terraform"  = "true"
          + "module"     = "elastic-cache"
        }
      + tags_all               = {
          + "CostCentre" = "cds-superset-prod"
          + "Name"       = "cds-sg"
          + "Terraform"  = "true"
          + "module"     = "elastic-cache"
        }
      + vpc_id                 = "vpc-0010287ba1021cc5c"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Error: Invalid value for input variable

  on redis.tf line 11, in module "superset-redis":
  11:   allowed_security_groups = {
  12:   #   "worker"      = module.superset-core.ecs_service_security_group_id
  13:   #   "app"         = module.superset-core.app_service_security_group_id
  14:   #   "worker_beat" = module.superset-core.worker_beat_service_security_group_id
  15:   "app" = aws_security_group.superset_ecs
  16:   }

The given value is not suitable for
module.superset-redis.var.allowed_security_groups declared at
../modules/aws/redis/input.tf:16,1-35: element "app": string required.
time=2024-01-16T20:04:20Z level=error msg=terraform invocation failed in /home/runner/work/cds-superset/cds-superset/terragrunt
time=2024-01-16T20:04:20Z level=error msg=1 error occurred:
	* [/home/runner/work/cds-superset/cds-superset/terragrunt] exit status 1



```

</details>

